<template>
  <div>
    <q-page class="q-pa-md">
      <div class="container">
        <h1 class="header-text">Правила проекта</h1>
        <h1 class="header-text"> </h1>
        <h2 class="header-text">Термины</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">Администрация – лица, наделенные исключительными правами в управлении игровым процессом и всем проектом.</p>
          <p class="text">Модераторы – лица, наделенные на безвозмездной основе группой прав для регулирования игрового процесса.</p>
          <p class="text">Хелпер – помощник модератора (не входят в состав модерации). Выполняет задачи по наблюдению и сигнализированию модератору о случаях, требующих вмешательства модератора, консультирует игроков в возникших вопросах, в пределах своей компетенции.</p>
          <p class="text">Игрок – лицо, достигшее возраста 14 лет (кроме серверов с возрастным ранжированием), пользующееся сервисами проекта по средствам программных решений и продуктов, предоставляемых Администрацией. ( Обязанность за соблюдением возрастных ограничений, лицами не достигшими возраста 18 лет, лежит полностью на родителях и иных законных представителях).</p>
          </q-card-section>
      </q-card>
          <div class="container">
          <h1 class="header-text"> </h1>
          <h2 class="header-text">Основные положения проекта</h2>
        </div>
      <q-card class="custom-card q-mb-md">
      <q-card-section>
        <p class="text">1. Данный документ является официальным регламентом проекта, любые прочие таковыми не могут называться.</p>
        <p class="text">2. Данные правила обязательны к исполнению на всех ресурсах проекта и всеми участниками, вне зависимости от обстоятельств и статусов.</p>
        <p class="text">3. Регистрируясь на проекте, Пользователь подтверждает согласие с данными правилами и согласие на сбор и обработку неперсонализированных технических данных, а также данных, присущих особенностям функционирования в сети Интернет.</p>
        <p class="text">4. Незнание данных правил не снимает ответственность с пользователя.</p>
        <p class="text">5. Цель данных правил – защита интересов пользователей и установление порядка на всех ресурсах проекта.</p>
        <p class="text">6. Исключительной обязанностью Администратора и Модератора является наблюдение за порядком на сервере. Администратор и Модератор вправе игнорировать все просьбы игроков, выходящие за рамки поддержания игрового порядка на проекте.</p>
        <p class="text">7. Толкование правил сайта осуществляется только главными Администраторами. Любые другие попытки истолковать правила в пользу любой из сторон признаются некорректными.</p>
        <p class="text">8. Администрация оставляет за собой право в одностороннем порядке изменять текущие правила. Изменения в правилах отслеживается пользователями самостоятельно на текущей странице сайта.</p>
        <p class="text">9. Администрация ведет управление игровыми процессами и всем проектом -исключительно по своему усмотрению.</p>
        <p class="text">10. Администратор вправе изъять у пользователя любое имущество, если пользователь не сможет доказать его честное (без использования запрещенных дополнительных программных средств – читов и т.д.) происхождение.</p>
        <p class="text">11. Так как не всегда удается определить нарушение правил пользователем, окончательное решение остается за Администраторами проекта.</p>
        <p class="text">12. Администраторы проекта оставляют за собой право закрыть пользователю возможность использования программного продукта по причине, не указанной в настоящих правилах.</p>
        <p class="text">13. Пользование сервисами осуществляется пользователем через клиентскую обязательную часть – Лаунчер, а так же по средствам дополнительно устанавливаемых (в зависимости от выбранного пользователем игрового режима и желаемых дополнительных функций) частей программного продукта – модов и сайта проекта.</p>
        <p class="text">14. Право использования всех сервисов проекта, предоставляется Администрацией на бесплатной основе, за исключением функций, возможность приобретения которых является дополнительной и необязательной, не дающих никаких возможностей, без которых невозможен полноценный игровой процесс. Использование функционала предоставляется в текущей форме, не гарантируя 100% правильность работы. Игровые вещи, способности и т.п, утерянные в связи с ненадлежащей работой неоплачиваемых сервисов, не возвращаются.</p>
        <p class="text">15. Оплата дополнительных, необязательных, игровых возможностей производится только на сайте проекта. Зачисление средств производится с помощью агрегатора платежей в любой валюте по месту нахождения пользователя, конвертируемой самим агрегатором в рубли. Указанные на страницах сайта сформированные формы, с обозначенными суммами платежей, являются рекомендацией и не носят обязательный характер, равно как и не являются публичной офертой или побуждением к действиям. Функционала вывода ИГРОВЫХ монет и рублей на реальные счета игроков НЕТ и такие выводы не могут быть осуществлены! ИГРОВЫЕ рубли и монеты используются только в игровом процессе и элементах сайта, затрагивающих игровые механики.</p>
        <p class="text">16. Периодические обновления(очистки) игрового мира – Вайп, производятся Администрацией по истечении временного отрезка, далее которого нормальное функционирование сервисов невозможно, ввиду особенностей построения игрового процесса. Длительность вышеуказанного временного отрезка определяется администрацией самостоятельно, исходя из технической возможности. Вайп не является отказом пользователю в использовании платных дополнений, т.к при этом не происходит отзыв лицензии на часть программного продукта или ограничения функционала этой части.

          При этом возможен возврат ранее приобретенных игровых предметов за срок 14 дней(на усмотрение Администрации этот срок может быть увеличен).</p>
        <p class="text">17. Правообладателями дополнительных частей продукта являются их авторы. Использование этих частей Администрацией осуществляется на основе соглашения о свободном распространении и использовании.</p>
        <p class="text">18. Модератор даёт оценку действий игрока, анализируя их соответствие правилам проекта, и выносит решение, руководствуясь собственными знаниями, опытом и соотнося принимаемое решение с личностью игрока.</p>
        <p class="text">19. В случае, если нарушение не несло большой общественной опасности, то к игроку могут быть применены более снисходительные наказания в виде устного предупреждения (УП), кика или предупреждения (варна). Возможность применения данных наказаний остаётся на усмотрение модераторов и хелперов, ориентирующихся на свой опыт, понимание ситуации и прочие обстоятельства, относящиеся к личности нарушителя.</p>
      </q-card-section>
      </q-card>
      <div class="container">
        <h1 class="header-text"> </h1>
        <h2 class="header-text">1. Основные положения проекта</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">1.1 Использование и/или распространение читов, несанкционированное внесение изменений в файлы игрового клиента.</p>
          <p class="warn">Наказание: первое нарушение – бан на 14 дней. Повторное нарушение – бан навсегда. (Исключение – баны от Console)</p>
          <p class="text">1.2 Использование багов игры.</p>
          <p class="warn">Наказание: бан до 5 дней. При повторных нарушениях – бан до 10 дней.</p>
          <p class="text">1.3 «Гриферство» приватов – использование механик игры с целью нанесения вреда имуществу, находящемуся в привате (затопление жидкостями, заражение, проклятья, убийство или кража мобов, порча насаждений и т. д.), а также поиск возможных его способов, независимо от результатов этого поиска.</p>
          <p class="warn">Наказание: бан до 30 дней.</p>
          <p class="text">1.4 Присвоение мобам, предметам, варпам, регионам и т.д. названий, несущих нецензурный, оскорбительный, порнографический или провокационный характер, а также нарушающих другие правила, в частности 4.10, равно как написание подобного содержания для книг, флагов региона, приветствий варпа и т.п.</p>
          <p class="warn">Наказание: бан от 1 до 24 часов.</p>
          <p class="text">1.5 Покупка/продажа ресурсов НЕ за ВНУТРИИГРОВЫЕ предметы/валюту, независимо от их происхождения.</p>
          <p class="warn">Наказание: бан навсегда.</p>
          <p class="text">1.6 Обман, мошенничество или подобные действия, приносящие материальный вред игрокам.</p>
          <p class="warn">Наказание: бан до 10 дней, при особо крупных потерях и/или многочисленных нарушениях – бан до 30 дней.</p>
          <p class="text">1.6.1 Обман и прочее введение в заблуждение игроков, принёсшее незначительный нематериальный вред или нацеленное принести материальный вред, но не принесшее его.</p>
          <p class="warn">Наказание: мут от 1 до 24 часов. При злоупотреблении – бан или мут до 5 дней.</p>
          <p class="text">1.7 Взлом, а также попытка взлома игроков или администрации.</p>
          <p class="warn">Наказание: глобальный бан.</p>
          <p class="text">1.8 Умышленная дестабилизация сервера или попытки обрушить сервер путем специально вызванных лагов или подобными способами.</p>
          <p class="warn">Наказание: глобальный бан.</p>
          <p class="text">1.9 Подстрекательство игроков на нарушения правил.</p>
          <p class="warn">Наказание: бан до 24 часов.</p>
          <p class="text">1.10 Многочисленные просьбы к Администрации и Модераторам, не относящиеся или выходящие за рамки выполнения ими своих обязанностей по п. VI «Основных положений».</p>
          <p class="warn">Наказание: мут до 1 часа.</p>
          <p class="text">1.11 Массовая (более 3-х человек) раздача ЦЕННЫХ ресурсов всеми различными способами (выкидывание, с помощью механизмов, проведение примитивных конкурсов, удаление привата).</p>
          <p class="warn">Наказание: бан до 60 дней, в случае причинения значительного ущерба экономике сервера – бан навсегда.</p>
          <p class="text">1.11.1 Рекламирование реальной раздачи, нарушающей п. 1.13, игроком, который ее не проводит, а также реклама или проведение раздачи, массовый характер и/или ценность ресурсов которой не удалось установить.</p>
          <p class="warn">Наказание: бан до 24 часов.</p>
          <p class="text">1.11.2 Автоматизированная продажа игровых ресурсов и предметов по ценам ниже минимальных магазинных лимитов в блоке обмена “предмет на предмет”.</p>
          <p class="warn">Наказание: Первый раз – бан до суток, при повторах – до 10 дней. Снос постройки.</p>
          <p class="text">1.12 Создание более 5 аккаунтов одним пользователем.</p>
          <p class="warn">Наказание: бан навсегда всех аккаунтов.</p>
          <p class="text">1.12.1 Одновременное нахождение на одном сервере более 3 аккаунтов одного пользователя.</p>
          <p class="warn">Наказание: бан всех аккаунтов до суток, при повторных нарушениях – бан до 10 дней.</p>
          <p class="text">1.13 Сбыт (продажа, купля, дарение), получение, хранение или использование дюпаных или полученных нечестным путем ресурсов, если пользователю заведомо было известно о неправомерном происхождении таковых.</p>
          <p class="warn">Наказание: бан навсегда с конфискацией подобных ресурсов.</p>
          <p class="text">1.14 Злонамеренное использование личных данных пользователей проекта в игре и на форуме.</p>
          <p class="warn">Наказание: бан в игре и на форуме от 5 до 30 дней. При повторном нарушении – бан навсегда.</p>
          <p class="text">1.15 Использование режима «anti-afk».</p>
          <p class="warn">Наказание: бан от 6 до 12 часов бана с последующим удалением данного сооружения (особо злостные нарушители – бан до 2 дней).</p>
          <p class="text">1.16 Торговля аккаунтами, равно как и попытки таковой, или доказанный факт передачи аккаунта.</p>
          <p class="warn">Наказание: бан навсегда.</p>
          <p class="text">1.17 Модераторы и хелперы имеют право забанить/замутить игрока в случае возникновения опасной ситуации, не предусмотренной правилами, если предотвратить потенциально неблагоприятные последствия невозможно иным образом. Срок бана или мута должен быть разумным, пропорциональным, а также достаточным для разрешения ситуации. Срок мута в любом случае не может превышать 3 дней, а срок бана – 30 дней. Уполномоченное лицо обязано снять с пользователя все ограничения, если причины их применения отпали.</p>
          <p class="text">1.18 Обход наказания.</p>
          <p class="warn">Наказание: соразмерное тому, которое обходится (не относится к случаям, когда предыдущий аккаунт был забанен за нарушение второго раздела правил).</p>
          <p class="text">1.19 Нарушение правил пользователем в личных сообщениях и другими способами, позволяющими писать сообщения во время мута.</p>
          <p class="warn">Наказание: бан на срок, соразмерный оставшемуся сроку мута.</p>
        </q-card-section>
      </q-card>
        <div class="container">
          <h2 class="header-text">2.Правила внутриигровой  идентификации</h2>
        </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">2.1 Никнейм и префикс не должны содержать в себе оскорбительных слов, мата, слов, имеющих явный порнографический или провокационный характер, ссылок, рекламы, или иным образом нарушать другие правила проекта.</p>
          <p class="warn">Наказание: бан навсегда. (В случае с префиксом, блокировка до его изменения)</p>
          <p class="text">2.2 Никнейм и префикс не должны каким-либо образом указывать на принадлежность к Администраторам или Модераторам и Хелперам.</p>
          <p class="warn">Наказание: бан навсегда. (В случае с префиксом, блокировка до его изменения).</p>
          <p class="text">2.3 Скин и/или плащ не должны нести порнографический характер, содержать оскорбительные слова, мат, слова, имеющие явный порнографический или провокационный характер, ссылки, рекламу или иным образом нарушать другие правила проекта.</p>
          <p class="warn">Наказание: бан на 1 день, в отдельных случаях – бан до устранения нарушения (смена скина/плаща)</p>
        </q-card-section>
      </q-card>
      <div class="container">
        <h1 class="header-text"> </h1>
        <h2 class="header-text">3. Правила строительства</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">3.1 Все отношения внутри приватов регулируются владельцами и участниками привата. Имущество, находящееся в привате, является общей собственностью владельцев и участников привата. Владелец несет риск того, что участники могут владеть, пользоваться и распоряжаться имуществом в привате по собственному усмотрению, вплоть до его присвоения, уничтожения, сбыта. Ответственность за нарушающие правила строения, расположенные в привате, несет его владелец, если только не существует явных доказательств нарушения правил участником привата.</p>
          <p class="text">3.2 Умышленная порча структуры игровых миров, в том числе дополнительных (ад, край, т.д.), совершенная вне привата: масштабное и хаотичное разрушение природных структур мира, не преследующее за собой цели получения ресурсов, а также оставление недорубов, разливание жидкостей, строительство столбов или построек, не несущих функциональный или эстетический характер, а также иные подобные действия.</p>
          <p class="warn">Наказание: бан до 5 дней.</p>
          <p class="text">3.3 Блокировка свободного доступа к чужим приватам/другим мирам, а также блокировка игроков в пространствах, из которых невозможно выбраться.</p>
          <p class="warn">Наказание: бан до 2-х дней, при повторных нарушениях – до 5 дней.</p>
          <p class="text">3.4 Установка точки дома (/home set) либо варпа (/warp set) на территории другого игрока без его одобрения.</p>
          <p class="warn">Наказание: удаление точки дома либо варпа.</p>
          <p class="text">3.5 Владелец и участники привата могут требовать покинуть их территорию ЛЮБОГО игрока, включая модераторов и хелперов в любой момент времени, КРОМЕ момента совершения нарушений правил проекта, фиксируемых игроком/хелпером/модератором, на указанной территории, а также в случае расположения на таковой территории ПУБЛИЧНОГО общественного пространства/сервиса – магазина, “качалки” и т.п. – при условии, что поведение игрока не противоречит общепринятым нормам и не препятствует функционированию расположенного на территории функционала. (Публичный варп, сам по себе, не является общественным пространством/сервисом)</p>
          <p class="warn">Наказание: выдворение за пределы территории, в случае повторения инцидента – бан до 24 часов.</p>
          <p class="text">3.6 Непреднамеренное сооружение построек, установка механизмов, создание конструкций и т.д., вызывающих дестабилизацию, лаги, обрушение сервера.</p>
          <p class="warn">Наказание: уничтожение построек. Бан от 1 до 30 дней.</p>
          <p class="text">3.7 Строительство нецензурных и оскорбительных слов и фигур, несущих порнографический и/или иной провокационный характер, а также объектов, нарушающих другие правила, в частности 4.10, равно как размещение подобных надписей и/или изображений на табличках и/или других интерфейсах, а также воспроизведение подобного аудио-контента через радио.</p>
          <p class="warn">Наказание: бан до 5 дней с последующим удалением нарушающего объекта.</p>
          <p class="text">3.8 Строительство в аду выше/на бедрока(е).</p>
          <p class="warn">Наказание: снос постройки, бан на сутки.</p>
        </q-card-section>
      </q-card>
      <div class="container">
        <h1 class="header-text"> </h1>
        <h2 class="header-text">4. Общение и чат</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">4.1 Использование выражений, унижающих человеческое достоинство и/или несущих оскорбительную охарактеризацию личности пользователей, а также выражений, содержащих в себе грубый троллинг, порнографический, эротический, насильственный или провокационный характер.</p>
          <p class="warn">Наказание: мут до 24 часов (особо злостные нарушители – мут до 3 дней или бан до 10 дней).</p>
          <p class="text">4.2 Грубые оскорбительные и/или провокационные высказывания в сторону родителей и прочих родственников.</p>
          <p class="warn">Наказание: мут до 3 дней (особо злостные нарушители – бан до 10 дней).</p>
          <p class="text">4.3 Флуд (одинаковые или имеющие одинаковый смысл сообщения, отправленные в чат 3 раза или более), а также спам бессмысленными сообщениями и/или капсом (3 раза и более).</p>
          <p class="warn">Наказание: первое нарушение – мут на 30 мин., при повторных нарушениях – мут до 12 часов.</p>
          <p class="text">4.3.1 Рекламирование или злоупотребление контекстным упоминанием магазина и/или варпа, а также своего стрима, разрешено не чаще, чем раз в 10 мин.</p>
          <p class="warn">Наказание: первое нарушение – мут на 30 мин., при повторных нарушениях – мут до 6 часов.</p>
          <p class="text">4.3.2 Злоупотребление командами и прочими действиями, отправляющими системные сообщения в чат другим игрокам.</p>
          <p class="warn">Наказание: бан от 1 до 24 часов.</p>
          <p class="text">4.4 Несогласованная с Администрацией целенаправленная реклама сторонних продуктов/ресурсов и т.п. любыми способами.</p>
          <p class="warn">Наказание: бан навсегда.</p>
          <p class="text">4.4.1 Сообщения, не имеющие признаков рекламы, содержащие любые ссылки, кроме тех, что ведут на официальный сайт/форум/дискорд проекта или вики, а также ссылок на собственный, соответствующий правилам, стрим.</p>
          <p class="warn">Наказание: мут от 1 до 24 часов.</p>
          <p class="text">4.5 Черезмерный мат в игровом чате.</p>
          <p class="warn">Наказание: первое нарушение – мут на 1 час, при повторных нарушениях – мут до 12 часов.</p>
          <p class="text">4.6 Коверкание и некорректное написание никнейма игрока в провокационных и/или оскорбительных целях.</p>
          <p class="warn">Наказание: первое нарушение – мут до часа. Повторное нарушение – мут до 12 часов.</p>
          <p class="text">4.7 Обсуждение читов, багов игры, равно как и поиск таковых, независимо от результатов этого поиска, признание в нарушении правил 1.1 и 1.2, если нет доказательств реального факта такого нарушения.</p>
          <p class="warn">Наказание: бан до 12 часов.</p>
          <p class="text">4.8 Предложение или обсуждение купли/продажи ресурсов НЕ за ВНУТРИИГРОВЫЕ предметы/валюту, независимо от их происхождения, если нет оснований полагать о серьезности намерений игрока.</p>
          <p class="warn">Наказание: бан до 3 дней</p>
          <p class="text">4.9 Пропаганда, оправдание или иное проявление приверженности к тоталитарным, авторитарным, антигуманным режимам, идеологиям или организациям, а также к аморальным и/или преступным субкультурам, движениям, группам или организациям. Дискриминация по любым признакам (расы, цвета кожи, национальности и т.д.), обсуждение военных конфликтов, вооруженной агрессии, современных острых политических или иных тем, разжигающих межнациональную, религиозную, расовую ненависть или вражду, а также тем, которые посягают на основополагающие права и свободы человека. Пропаганда табачных, наркотических, алкогольных веществ.</p>
          <p class="warn">Наказание: при первом нарушении мут до 5 дней; при повторном нарушении – мут или бан до 10 дней. При злостном злоупотреблении – бан навсегда. </p>
        </q-card-section>
      </q-card>
      <div class="container">
        <h1 class="header-text"> </h1>
        <h2 class="header-text">5. PvP правила</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">5.1 Убийство игроков в зоне респауна и при телепортации.</p>
          <p class="warn">Наказание: бан до 5 дней.</p>
          <p class="text">5.2 Убийство игроков в зоне и из зоны «no-pvp».</p>
          <p class="warn">Наказание: бан до 5 дней.</p>
          <p class="text">5.3 Включенный флаг PvP в магазинах или иных общественных местах (качалки, фармилки и т.п.), кроме отдельно выделенных зон для PvP-арен с явно заметным разграничением между зонами PvP – PvE и соответствующим предупреждением, расположенным на видном месте.</p>
          <p class="warn">Наказание: бан до 5 дней. При повторных нарушениях – полная блокировка всей территории магазина/общественного места.</p>
          <p class="text">5.4 Перезаход во время PvP с целью получения временного бессмертия или избежания схватки.</p>
          <p class="warn">Наказание: бан на 2 часа, при систематических нарушениях – до 3 дней.</p>
          <p class="text">5.5 Включенный флаг pvp в регионе без явно заметных предупреждений об этом.</p>
          <p class="warn">Наказание: бан до 5 дней.</p>
          <p class="text">5.6 Использование на серверах удочки и т.п. не по прямому назначению.</p>
          <p class="warn">Наказание: бан от 1 до 4 часов.</p>
          <p class="text">5.7 “Заталкивание” игроков в зону PvP всеми возможными способами (снежки, куриные яйца, жемчуга эндера, удочки и прочее).</p>
          <p class="warn">Наказание: бан от 1 до 6 часов.</p>
        </q-card-section>
      </q-card>
      <div class="container">
        <h1 class="header-text"> </h1>
        <h2 class="header-text">6. Правила размещения контента</h2>
      </div>
      <q-card class="custom-card q-mb-md">
        <q-card-section>
          <p class="text">6.1 Использование оскорбительных слов, ,большого количества мата, иного контента, носящего порнографический, насильственный или провокационный характер.</p>
          <p class="warn">Наказание: блокировка на сайте сроком до 5 дней.</p>
          <p class="text">6.2 Клевета на игроков и администрацию.</p>
          <p class="warn">Наказание: блокировка на сайте и в игре сроком до 30 дней.</p>
          <p class="text">6.3 Создание бессмысленных тем в тематических разделах форума дискорда.</p>
          <p class="warn">Наказание: блокировка на форуме дискорд сроком до 3-х дней.</p>
          <p class="text">6.4 Публикация рекламных ссылок.</p>
          <p class="warn">Наказание: перманентная блокировка на форуме дискорд и игровых серверах.</p>
          <p class="text">6.5 Флуд сообщениями в тематических разделах.</p>
          <p class="warn">Наказание: блокировка на форуме дискорд сроком от 5 до 30 дней.</p>
          <p class="text">6.6 Подделка доказательств.</p>
          <p class="warn">Наказание: первый раз блокировка в игре и на форуме дискорд – 5 дней. Повторно – от 20 до 30 дней.</p>
          <p class="text">6.7 Набивание репутации/сообщений.</p>
          <p class="warn">Наказание: обнуление статистики аккаунта. Повторно – блокировка от 20 до 30 дней.</p>
          <p class="text">6.8 Сообщения, которые содержат в себе токсичный контент.</p>
          <p class="warn">Наказание: блокировка на форуме дискорд сроком от 5 до 30 дней.</p>
          <p class="text">6.9 Преднамеренное занижение/завышения рейтинга игроков на форуме дискорд.</p>
          <p class="warn">Наказание: первое нарушение – удаление накрученных реакций. Повторно – блокировка до 5 дней.</p>
        </q-card-section>
      </q-card>
    </q-page>
  </div>
</template>

<script>

</script>


<style scoped>
.text {
  font-size: 18px;
  line-height: 1.6;
  font-stretch: normal;
  text-align: left;
}
.warn {
  font-style:oblique;
  font-size: 18px;
  line-height: 1.6;
  font-stretch: normal;
  text-align: left;
}
.container {
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: center;
  margin-bottom: 20px;
}
.custom-card {
  border-radius: 20px;
  background-color: #f0f0f0;
  position: relative;
  padding: 20px;
}

.custom-card:before {
  content: "";
  position: absolute;
  top: -20px;
  left: 50%;
  transform: translateX(-50%);
  width: 0;
  height: 0;
  border-left: 20px solid transparent;
  border-right: 20px solid transparent;
  border-bottom: 20px solid #f0f0f0;
}
.header-text {
  margin: 0;
  color: #ffffff;
  font-weight: 500 ;

}
.floating-element {
  top: 50%;
  left: 50%;
  transform: translate(-40%, -40%);
  transition: transform 0.4s ease;
  animation: floating 4s ease-in-out infinite;
}

@keyframes floating {
  0% {
    transform: translateY(0);
  }
  50% {
    transform: translateY(-10px);
  }
  100% {
    transform: translateY(0);
  }
}
</style>
